#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_uuid.name_uuid: Refreshing state... [id=639892f7-7085-3517-fc33-9efaea88716e]
data.aws_acm_certificate.domain-cert: Reading...
aws_cloudfront_origin_access_control.s3-oac: Refreshing state... [id=EQBDJPSO1IDVQ]
aws_s3_bucket.s3-website-bucket: Refreshing state... [id=static-website-poc-639892f7-7085-3517-fc33-9efaea88716e]
data.aws_acm_certificate.domain-cert: Read complete after 0s [id=arn:aws:acm:us-east-1:380958218357:certificate/fc2d1df8-79a5-42e0-bade-ab329e1cc345]
aws_s3_bucket_website_configuration.s3-website-configuration: Refreshing state... [id=static-website-poc-639892f7-7085-3517-fc33-9efaea88716e]
aws_s3_bucket_public_access_block.s3-public-access-block: Refreshing state... [id=static-website-poc-639892f7-7085-3517-fc33-9efaea88716e]
aws_cloudfront_distribution.s3-website-distribution: Refreshing state... [id=E13SFJSUUQD497]
data.aws_iam_policy_document.s3-website-public-policy-document: Reading...
data.aws_iam_policy_document.s3-website-public-policy-document: Read complete after 0s [id=3538891225]
aws_s3_bucket_policy.s3-website-public-policy: Refreshing state... [id=static-website-poc-639892f7-7085-3517-fc33-9efaea88716e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.website_files["assets/index-COcDBgFa.css"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "static-website-poc-639892f7-7085-3517-fc33-9efaea88716e"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "14d54539054b6abaa4878a58be0e783f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-COcDBgFa.css"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-2"
      + server_side_encryption = (known after apply)
      + source                 = "../dist/assets/index-COcDBgFa.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["assets/index-WWygZsef.js"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "static-website-poc-639892f7-7085-3517-fc33-9efaea88716e"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "ac8e4539cb736dad6ab1a52ef4b738bb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-WWygZsef.js"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-2"
      + server_side_encryption = (known after apply)
      + source                 = "../dist/assets/index-WWygZsef.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["assets/react-CHdo91hT.svg"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "static-website-poc-639892f7-7085-3517-fc33-9efaea88716e"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "f0402b67b6ce880f65666bb49e841696"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/react-CHdo91hT.svg"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-2"
      + server_side_encryption = (known after apply)
      + source                 = "../dist/assets/react-CHdo91hT.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["index.html"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "static-website-poc-639892f7-7085-3517-fc33-9efaea88716e"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "caa0ca2ca021724dd16409f56e3408ee"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-2"
      + server_side_encryption = (known after apply)
      + source                 = "../dist/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["vite.svg"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "static-website-poc-639892f7-7085-3517-fc33-9efaea88716e"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "8e3a10e157f75ada21ab742c022d5430"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "vite.svg"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-2"
      + server_side_encryption = (known after apply)
      + source                 = "../dist/vite.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ZakariaTalhami, Action: `pull_request`*